Tekla Open API Reference for Tekla Structures 2025
ShapeCatalog.OnValueChanged Method
 Event handler for passing generic catalog data back to dialog
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void OnValueChanged(
	Object data
)
Public Sub OnValueChanged (
	data As Object
)
Parameters
data
Type: System.Object
value data
See Also
Reference
ShapeCatalog Class
Tekla.Structures.Dialog.UIControls Namespace